'''
Напишите программу, которая переворачивает любое слово.
'''
print(str[::-1])
