"""
Программа получает на вход неудобный текст, выводит удобный.
Смотри прошлый шаг.
------------
Программирование — процесс создания компьютерных программ.
"""
print(input().lower().lstrip().capitalize())
