'''
Напишите программу, которая получает на вход любую фразу и отрезает от нее последнии четыре буквы.
'''
print(input()[:-4])
