'''
Напишите программу, которая получает строку символов и выводит ее в столбик, как в примере ниже.
'''
n = input()

for i in n:
    print(i)
