'''
Напишите программу, которая считает количество гласных букв в введенной фразе.
 Гласные буквы: а, о, э, е, и, ы, у, ё, ю, я.
'''
n = 0
alphas = ["а", "о", "э", "е", "и", "ы", "у", "ё", "ю", "я"]

for i in input():
    if i in alphas:
        n += 1

print(n)
