'''
Напишите программу, которая считывает одну строку.
И если в строке есть слово "мир" выводит "Найдено" или если такого слова нет "Нет"
'''
#str = input()

print("Найдено" if ("мир" in input()) else "Нет")
